{"class_name": "Model", "config": {"name": "model_27", "layers": [{"name": "input_38", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 200], "dtype": "int32", "sparse": false, "name": "input_38"}, "inbound_nodes": []}, {"name": "embedding_5", "class_name": "Embedding", "config": {"name": "embedding_5", "trainable": false, "batch_input_shape": [null, 200], "dtype": "float32", "input_dim": 11337, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 200}, "inbound_nodes": [[["input_38", 0, 0, {}]]]}, {"name": "conv1d_113", "class_name": "Conv1D", "config": {"name": "conv1d_113", "trainable": true, "filters": 256, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_5", 0, 0, {}]]]}, {"name": "max_pooling1d_77", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_77", "trainable": true, "strides": [3], "pool_size": [3], "padding": "valid"}, "inbound_nodes": [[["conv1d_113", 0, 0, {}]]]}, {"name": "dropout_28", "class_name": "Dropout", "config": {"name": "dropout_28", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_77", 0, 0, {}]]]}, {"name": "conv1d_114", "class_name": "Conv1D", "config": {"name": "conv1d_114", "trainable": true, "filters": 256, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_28", 0, 0, {}]]]}, {"name": "max_pooling1d_78", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_78", "trainable": true, "strides": [3], "pool_size": [3], "padding": "valid"}, "inbound_nodes": [[["conv1d_114", 0, 0, {}]]]}, {"name": "dropout_29", "class_name": "Dropout", "config": {"name": "dropout_29", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_78", 0, 0, {}]]]}, {"name": "conv1d_115", "class_name": "Conv1D", "config": {"name": "conv1d_115", "trainable": true, "filters": 256, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_29", 0, 0, {}]]]}, {"name": "global_max_pooling1d_27", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_27", "trainable": true}, "inbound_nodes": [[["conv1d_115", 0, 0, {}]]]}, {"name": "dropout_30", "class_name": "Dropout", "config": {"name": "dropout_30", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["global_max_pooling1d_27", 0, 0, {}]]]}, {"name": "dense_53", "class_name": "Dense", "config": {"name": "dense_53", "trainable": true, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_30", 0, 0, {}]]]}, {"name": "dropout_31", "class_name": "Dropout", "config": {"name": "dropout_31", "trainable": true, "rate": 0.4, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_53", 0, 0, {}]]]}, {"name": "dense_54", "class_name": "Dense", "config": {"name": "dense_54", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_31", 0, 0, {}]]]}], "input_layers": [["input_38", 0, 0]], "output_layers": [["dense_54", 0, 0]]}, "keras_version": "2.2.0", "backend": "tensorflow"}